openfoam/karmanvortexstreet/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)
    (0 0.4 0)
    (0 0.6 0)
    (0 1 0)
    (0.4 0 0)
    (0.4 0.4 0)
    (0.4 0.6 0)
    (0.4 1 0)
    (0.6 0 0)
    (0.6 0.4 0)
    (0.6 0.6 0)
    (0.6 1 0)
    (1 0 0)
    (1 0.4 0)
    (1 0.6 0)
    (1 1 0)
    (5 0 0)
    (5 0.4 0)
    (5 0.6 0)
    (5 1 0)
    (0 0 0.1)
    (0 0.4 0.1)
    (0 0.6 0.1)
    (0 1 0.1)
    (0.4 0 0.1)
    (0.4 0.4 0.1)
    (0.4 0.6 0.1)
    (0.4 1 0.1)
    (0.6 0 0.1)
    (0.6 0.4 0.1)
    (0.6 0.6 0.1)
    (0.6 1 0.1)
    (1 0 0.1)
    (1 0.4 0.1)
    (1 0.6 0.1)
    (1 1 0.1)
    (5 0 0.1)
    (5 0.4 0.1)
    (5 0.6 0.1)
    (5 1 0.1)

);

blocks
(
    hex (0 4 5 1 20 24 25 21) (4 4 1) simpleGrading (1 1 1)
    hex (4 8 9 5 24 28 29 25) (2 4 1) simpleGrading (1 1 1)
    hex (8 12 13 9 28 32 33 29) (4 4 1) simpleGrading (1 1 1)
    hex (12 16 17 13 32 36 37 33) (40 4 1) simpleGrading (1 1 1)
    hex (1 5 6 2 21 25 26 22) (4 2 1) simpleGrading (1 1 1)
    hex (9 13 14 10 29 33 34 30) (4 2 1) simpleGrading (1 1 1)
    hex (13 17 18 14 33 37 38 34) (40 2 1) simpleGrading (1 1 1)
    hex (2 6 7 3 22 26 27 23) (4 4 1) simpleGrading (1 1 1)
    hex (6 10 11 7 26 30 31 27) (2 4 1) simpleGrading (1 1 1)
    hex (10 14 15 11 30 34 35 31) (4 4 1) simpleGrading (1 1 1)
    hex (14 18 19 15 34 38 39 35) (40 4 1) simpleGrading (1 1 1)
);


edges
(
    arc 5 9 (0.5 0.358578644 0)
    arc 9 10 (0.641421356 0.5 0)
    arc 10 6 (0.5 0.641421356 0)
    arc 6 5 (0.358578644 0.5 0)
    arc 25 29 (0.5 0.358578644 0.1)
    arc 29 30 (0.641421356 0.5 0.1)
    arc 30 26 (0.5 0.641421356 0.1)
    arc 26 25 (0.358578644 0.5 0.1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 21 20)
            (1 2 22 21)
            (2 3 23 22)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (16 17 37 36)
            (17 18 38 37)
            (18 19 39 38)
        );
    }

    obstacle
    {
        type wall;
        faces
        (
            (5 9 29 25)
            (9 10 30 29)
            (10 6 26 30)
            (6 5 25 26)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (3 7 27 23)
            (7 11 31 27)
            (11 15 35 31)
            (15 19 39 35)
        );
    }
    lowerWall
    {
       type wall;
       faces
       (
            (0 4 24 20)
            (4 8 28 24)
            (8 12 32 28)
            (12 16 36 32)
       );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (4 8 5 9)
            (8 12 13 9)
            (12 16 17 13)
            (1 5 6 2)
            (9 13 14 10)
            (13 17 18 14)
            (2 6 7 3)
            (6 10 11 7)
            (10 14 15 11)
            (14 18 19 15)
            (20 24 25 21)
            (24 28 25 29)
            (28 32 33 29)
            (32 36 37 33)
            (21 25 26 22)
            (29 33 34 30)
            (33 37 38 34)
            (22 26 27 23)
            (26 30 31 27)
            (30 34 35 31)
            (34 38 39 35)
        );
    }
);


// ************************************************************************* //
