openfoam/karmanvortexstreet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       928;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       938;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       948;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       956;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       1006;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          992;
        startFace       1056;
    }
)

// ************************************************************************* //
